load-tests/profile_high.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        localhost

Document Path:          /api/catalog
Document Length:        8297 bytes

Concurrency Level:      50
Time taken for tests:   2.598 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    500
Total transferred:      4288000 bytes
HTML transferred:       4148500 bytes
Requests per second:    192.42 [#/sec] (mean)
Time per request:       259.842 [ms] (mean)
Time per request:       5.197 [ms] (mean, across all concurrent requests)
Transfer rate:          1611.56 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  12.7      0      50
Processing:     6  248 142.8    199     593
Waiting:        4  248 142.8    199     593
Total:          9  252 139.1    201     593

Percentage of the requests served within a certain time (ms)
  50%    201
  66%    274
  75%    314
  80%    361
  90%    501
  95%    518
  98%    563
  99%    590
 100%    593 (longest request)